app/controllers/cursos_controller.rb

  def index
    @cursos = Curso.all
---
SELECT `cursos`.* FROM `cursos`

  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save
---
INSERT INTO `cursos` (`cur_status`, `cur_nome`, `cur_tempo_duracao`, `cur_valor`, `cur_data_inicio`, `cur_data_termino`, `created_at`, `updated_at`) VALUES (1, 'BACHARELADO EM CIÊNCIAS DA COMPUTAÇÃO', 3120, 0.0, '2016-02-14', '2020-02-14', '2016-02-14 14:22:03', '2016-02-14 14:22:03')

  def update
    respond_to do |format|
      if @curso.update(curso_params)
---
UPDATE `cursos` SET `cur_nome` = 'Teste 2', `updated_at` = '2016-02-14 14:48:04' WHERE `cursos`.`id` = 3

  def destroy
    @curso.destroy
---
DELETE FROM `cursos` WHERE `cursos`.`id` = 3

    def set_curso
      @curso = Curso.find(params[:id])
---
SELECT  `cursos`.* FROM `cursos` WHERE `cursos`.`id` = 3 LIMIT 1