app/controllers/escolas_controller.rb

SELECT `escolas`.* FROM `escolas`
---
  def index
    @escolas = Escola.all