app/controllers/tipo_usuarios_controller.rb

  def index
    @tipo_usuarios = TipoUsuario.all
---
SELECT `tipo_usuarios`.* FROM `tipo_usuarios`

  def create
    @tipo_usuario = TipoUsuario.new(tipo_usuario_params)

    respond_to do |format|
      if @tipo_usuario.save
---
INSERT INTO `tipo_usuarios` (`tpu_nome`, `tpu_status`, `created_at`, `updated_at`) VALUES ('ADMINISTRADOR', 1, '2016-02-14 01:23:59', '2016-02-14 01:23:59')

  def update
    respond_to do |format|
      if @tipo_usuario.update(tipo_usuario_params)
---
UPDATE `tipo_usuarios` SET `tpu_nome` = 'ADMINISTRADOR SISTEMA', `updated_at` = '2016-02-14 02:29:05' WHERE `tipo_usuarios`.`id` = 1

  def destroy
    @tipo_usuario.destroy
---
DELETE FROM `tipo_usuarios` WHERE `tipo_usuarios`.`id` = 4

    def set_tipo_usuario
      @tipo_usuario = TipoUsuario.find(params[:id])
---
SELECT  `tipo_usuarios`.* FROM `tipo_usuarios` WHERE `tipo_usuarios`.`id` = 4 LIMIT 1