app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT `usuarios`.* FROM `usuarios`

  def new
    @tipos_usuarios = TipoUsuario.all
---
SELECT  `tipo_usuarios`.* FROM `tipo_usuarios`  ORDER BY `tipo_usuarios`.`id` ASC LIMIT 1

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`usr_nome`, `usr_cpf`, `usr_sexo`, `usr_matricula`, `usr_senha`, `created_at`, `updated_at`) VALUES ('Airon Wellington Lima dos Santos', '02647064393', 'Masculino', '123456789', '123456', '2016-02-15 00:41:36', '2016-02-15 00:41:36')

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1