app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos`
---
  def index
    @videos = Video.all

INSERT INTO `videos` (`vid_titulo`, `vid_descricao`, `vid_link`, `disciplina_id`, `created_at`, `updated_at`) VALUES ('Biologia 01', 'Ecologia', 'www.youtube.com/biologia', 1, '2016-02-15 02:10:27', '2016-02-15 02:10:27')
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save